export const arabicTranslations = {
  navbar: {
    title: "الرئيسية",
    about: "عن الشركة",
    service: "الخدمات",
    information: "المزيد من المعلومات",
    testimonial: "رأي العملاء",
    contact: "تواصل معنا",
    price: "الأسعار",
    reservation: "الحجز"
  },
  inputFields: {
    subtitle: "إذا لم تطلب إلغاء أو إعادة جدولة موعدك في غضون 24 ساعة من الوقت المحدد، سيتم خصم رسوم تبلغ 50% من تكلفة الاستشارة الأولية.",
    paragraph: " يمكن الغاء الحجز من خلال الواتس ئب او الايميل قبل ٢٤ ساعة من الموعد",
    finland: "المواعيد بتوقيت فلندا",
    goalOfTheMeeting: "هدف الاجتماع",
    onsite: "في الموقع",
    zoom: "زووم",
    location: "الموقع",
    makeAreservation: "احجز موعدًا",
    name: "الاسم",
    namePlaceHolder: "أدخل اسمك",
    phoneNumber: "رقم الهاتف",
    phoneNumberPlaceholder: "أدخل رقم هاتفك",
    email:  "البريد الإلكتروني",
    emailPlaceholder: "أدخل بريدك الإلكتروني",
    appointmentDate: "تاريخ الموعد",
    appointmentTime: "وقت الموعد",
    selectTime: "اختر الوقت",
    submit: "إرسال",
    loading: "جار التحميل..."
  },
  companyName: "Safe Healthy Bite",
  slogan: "غذاء آمن، خيارات صحية، حياة أفضل",
  description: "في شركتنا، نؤمن بأن الغذاء ليس مجرد وقود، بل هو أداة قوية للصحة والرفاهية وطول العمر. نقودك نحو حياة أكثر صحة من خلال إدارة سلامة الأغذية المتخصصة، والنصائح الغذائية، والعلاجات الطبيعية.",
  services: {
    foodSafety: "سلامة الغذاء",
    nutritionAdvisory: "استشارات الصحة العامة والتغذية"
  },
  get_in_touch: {
    contact_us: "اتصل بنا",
    email: "البريد الإلكتروني",
    phone: "الهاتف",
    location: "الموقع",
    calling_time: "أوقات الاتصال",
    follow_us: "تابعنا",
    stay_updated: "ابق على اطلاع"
  },
  price: {
    consultation: {
      title: "الاستشارة الأولية",
      options: {
        half_hour: {
          time: "30 دقيقة",
          price: "25 يورو"
        },
        one_hour: {
          time: "60 دقيقة",
          price: "50 يورو"
        },
      },
      content: "تتضمن المقابلة الأولية معرفة الحالة المرضية والأهداف."
    },
    guts_cleansing_program: {
      title: "برنامج تنظيف الأمعاء",
      duration: "7–10 أيام",
      price: "25 يورو"
    },
    detox_program: {
      title: "برنامج التخلص من السموم",
      duration: "7–10 أيام",
      price: "50 يورو - 60 يورو",
      content: "يشمل مواد وبرنامج التخلص من السموم."
    },
    follow_up_program: {
      title: "البرامج الغذائية التالية",
      starting: {
        price: "يبدأ من 50 يورو",
        content: "يتم تسعير البرامج الغذائية وفقا للحالة الصحية وفقا للهدف المنشود بشكل فردي."
      }
    },
    follow_up_calls: {
      title: "مكالمة متابعة الحالة",
      options: {
        monthly: {
          frequency: "3–4 مرة/ الشهر",
          price: "50 يورو"
        },
        three_months: {
          frequency: "9 مرات / 3 أشهر",
          price: "120 يورو"
        }
      }
    },
    training: {
      title: "التدريب (في العراق فقط)",
      food_safety: {
        title: "تدريب السلامة الغذائية",
        individual: {
          title: "التدريب الفردي",
          price: "25 يورو / شخص"
        },
        company: {
          title: "التدريب للشركات",
          price: "35 يورو / شخص"
        }
      }
    }
  },  
  testimonial: {
    title: "رأي العملاء",
    before_after: {
      before: "قبل",
      after: "بعد",
      title: "تحول مثير للإعجاب",
      content: "يسعدنا أن نستعرض التقدم الملحوظ الذي أحرزناه بعد تلقي خدماتنا. ويعكس هذا التحول التزامنا بالتميز وتقديم نتائج متميزة.",
    },
    customer_main: {
      title: "العميل الرئيسي",
      content: "فقدت 18 كجم في 3 أشهر وأشعر برائع!"
    },
    customer_one: {
      name: "العميل الأول",
      content: "غيرت هذه الخدمة حياتي!"
    },
    customer_two: {
      name: "العميل الثاني",
      content: "جودة استثنائية ودعم!"
    },
    customer_three: {
      name: "العميل الثالث",
      content: "أنا ممتن للغاية للمساعدة التي حصلت عليها!"
    }
  },
  safeHealthyBite: {
    title: "لقمة صحية آمنة",
    tagline: "سلامة الغذاء | استشارات عامة في الصحة والتغذية",
    introduction: "طريقك نحو حياة أكثر صحة يبدأ هنا",
    aboutMe: {
      header: "عنّي",
      content: `
        أنا د. ھاژاومراد (ھاجر)، طبيبة بيطرية حاصلة على ماجستير في الصحة العامة البيطرية ودكتوراه صحة الغذاء والسيطرة النوعية من العراق. 
        مع أكثر من 20 عامًا من الخبرة في سلامة الأغذية والاستشارات الصحية، كرّست حياتي المهنية لفهم الدور الأساسي للغذاء في تعزيز الصحة. 
        بالإضافة إلى ذلك، أحمل دبلومات في التغذية البشرية من مصر و"أليسون"، ما زلت أخضع للتعليم بصورة مستمرة لأن إنتاج الغذاء يتطور باستمرار، 
        لذلك أريد أيضًا أن أشارك في التغييرات الحالية المتعلقة بالتغذية والغذاء. كل هذا يسلط الضوء على أنني ملتزمة ومتابعة جدا للصحة الشمولية. 
        رحلتي الأكاديمية السابقة كأستاذة جامعية، إلى جانب إدارتي لعيادتي في العراق وعملي كمدربة للجواز الصحي (كارد النظافة الصحي) في فنلندا، 
        قد أتاحت لي الفرصة لقيادة العديد من ورش العمل والدورات التدريبية للأطباء البيطريين، مفتشي الأغذية، عمال الأغذية، والمهنين في مجالات الأعمال المتعلقة بالغذاء، 
        وقد ساعدتني هذه التجارب على تطوير قدرات تعليمية قوية وصقل مهاراتي في تقديم التوجيه الفعّال.
      `
    },
    
    vision: {
      header: "رؤيتي",
      content: `
        طوال مسيرتي المهنية كمتخصصة في نظافة وسلامة الأغذية، زادت قناعتي بأن المعدة هي أصل معظم الأمراض، كما علمنا رسولنا الكريم (ص) - عندما تتعامل معها بشكل سيء، ستستجيب لك بطريقة بأسوأ. لهذا السبب، فإن اتخاذ خيارات غذائية ذكية هو أمر حاسم للحفاظ على الصحة العامة.
    
        على مدار السنوات، شهدت بنفسي كيف تؤثر سلامة وجودة الأغذية على الصحة العامة. العادات الغذائية السيئة والتعامل غير الآمن مع الطعام يمكن أن يتسببا في دمار لصحتنا، ولكن مع الإرشاد الصحيح، والتعديلات في النظام الغذائي، وممارسات سلامة الغذاء، يمكن الوقاية من العديد من المشاكل الصحية أو حتى معالجتها.
    
        لقد ساعدت العديد من الأشخاص على التعافي من حالات صحية خطيرة من خلال تعديل عاداتهم الغذائية واتخاذ خيارات غذائية أكثر وعياً. أنا هنا لأرشدك على الطريق نحو حياة أكثر صحة. نهجي يجمع بين مبادئ سلامة الأغذية الحديثة والعلاجات الطبيعية القائمة على الغذاء، لأنني أؤمن بأن الشفاء يبدأ مما نأكله.
    
        غذاء أفضل، صحة أفضل، حياة أفضل
      `
    },
    
    services: {
      header: "الخدمات المقدمة",
      generalHealth: {
        header: "استشارات عامة في الصحة والتغذية",
        items: [
          "نصائح غذائية شخصية، تركز على العلاجات الطبيعية والتغذية المتوازنة.",
          "حلول مخصصة لإدارة والتغلب على الحالات الصحية من خلال تحسين العادات الغذائية.",
          "ورش عمل تغذوية للمجتمعات والشركات."
        ]
      },
      foodSafety: {
        header: "استشارات سلامة الغذاء",
        items: [
          "مساعدة الشركات في ضمان أن منتجاتها الغذائية تلبي أعلى معايير السلامة.",
          "تقديم تدريب على النظافة الغذائية لحماية شركتك من المخاطر الصحية والخسائر المالية.",
          "توفير تدريب على جوازات النظافة لعمال الأغذية في العراق وفنلندا."
        ]
      },
      naturalRemedies: {
        header: "العلاجات الطبيعية لتحسين الصحة",
        items: [
          "إرشادات حول استخدام الأطعمة الطبيعية الكاملة لتغذية الجسم وشفائه.",
          "توصيات لنمط حياة شامل يعزز الرفاهية على المدى الطويل."
        ]
      }
    },
    whyChooseUs: {
      header: "لماذا تختار Safe Healthy Bites؟",
      content: "مع عقود من الخبرة في سلامة الغذاء والتغذية، أفهم العلاقة العميقة بين ما نأكله وصحتنا العامة. مهمتي هي ضمان الالتزام بممارسات سلامة الغذاء من قبل الشركات، مع تمكين الأفراد من اتخاذ خيارات صحية. من خلال التركيز على حلول غذائية طبيعية وممارسات معالجة غذاء آمنة، أساعد عملائي على العيش حياة أكثر صحة."
    },
    callToAction: {
      header: "دعنا نعمل معًا من أجل غدٍ أكثر صحة!",
      content: "سواء كنت بحاجة إلى استشارة، تدريب، أو نصائح صحية شخصية، أنا هنا لمساعدتك في حماية صحتك وعملك الغذائي. لنبدأ معًا في بناء مستقبل صحي."
    },
    contact: {
      header: "تواصل معي",
      content: "هل أنت مستعد للبدء في طريقك نحو صحة أفضل أو حماية عملك من خلال إدارة سلامة الغذاء المتخصصة؟ اتصل بي اليوم لتحديد موعد للاستشارة.",
      email: "[أدخل البريد الإلكتروني]",
      phone: "+358 417105564",
      location: "في الموقع في صالون بينكي، إيتاكيسكوس، هلسنكي أو عبر الإنترنت، عبر زووم أو فرق.",
      friday: "الجمعة 9-15",
      saturday: "السبت 11-15"
    },
    prices: {
      header: "الأسعار",
      consultation: {
        halfHour: "استشارة ½ ساعة 25 €",
        oneHour: "1 ساعة 50 €"
      },
      tailoredProgram: "يبدأ البرنامج المخصص من 50 €",
      followingCheckup: "المراجعة التالية 50 € / شهر. (تتكون من 4 مكالمات هاتفية/شهر، تعديل البرنامج إذا لزم الأمر) 120 € / 3 شهور.",
      foodSafetyTraining: {
        individual: "تدريب سلامة الغذاء للفرد 35/شخص",
        company: "تدريب سلامة الغذاء للشركة 25/شخص"
      }
    }
  }
};
